app/controllers/declarations_controller.rb

  def index
    @declarations = Declaration.all
---
SELECT "declarations".* FROM "declarations"

  def create
    @declaration = Declaration.new(declaration_params)

    respond_to do |format|
      if @declaration.save
---
INSERT INTO "declarations" ("declaration_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["declaration_name", "Teste"], ["description", "Teste"], ["created_at", "2017-09-19 17:37:03.237384"], ["updated_at", "2017-09-19 17:37:03.237384"]]

  def update
    respond_to do |format|
      if @declaration.update(declaration_params)
---
UPDATE "declarations" SET "description" = ?, "updated_at" = ? WHERE "declarations"."id" = ?  [["description", "Declaração de Serviço de Distribuição de cartórios"], ["updated_at", "2017-10-17 17:34:25.190533"], ["id", 6]]

  def destroy
    @declaration.destroy
---
DELETE FROM "declarations" WHERE "declarations"."id" = ?  [["id", 1]]

    def set_declaration
      @declaration = Declaration.find(params[:id])
---
SELECT  "declarations".* FROM "declarations" WHERE "declarations"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]